esp32-open-mac/qemu/hw/dma/esp32c3_gdma.c
/*
 * ESP32-C3 GDMA emulation
 *
 * Copyright (c) 2023 Espressif Systems (Shanghai) Co. Ltd.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */

#include "qemu/osdep.h"
#include "qemu/error-report.h"
#include "sysemu/dma.h"
#include "hw/sysbus.h"
#include "hw/irq.h"
#include "hw/dma/esp32c3_gdma.h"
#include "hw/qdev-properties.h"
#include "hw/qdev-properties-system.h"

#define GDMA_WARNING 0
#define GDMA_DEBUG   0

/**
 * Check the header file for more info about this function
 */
int esp32c3_gdma_get_channel_periph(ESP32C3GdmaState *s, GdmaPeripheral periph, int dir)
{
    /* If the state, the peripheral or the direction is invalid, return directly */
    if (s == NULL ||
        periph > GDMA_LAST || periph == GDMA_RSVD1 || periph == GDMA_RSVD4 || periph == GDMA_RSVD5 ||
        dir < 0 || dir >= ESP32C3_GDMA_CONF_COUNT)
    {
        return -1;
    }

    /* Check all the channels of the GDMA */
    for (int i = 0; i < ESP32C3_GDMA_CHANNEL_COUNT; i++) {
        /* IN/OUT PERI registers have the same organization, can use any macro */
        if (FIELD_EX32(s->ch_conf[i][dir].peripheral, DMA_IN_PERI_SEL_CH0, PERI_IN_SEL_CH0) == periph) {
            return i;
        }
    }

    return -1;
}


/**
 * @brief Structure defining how linked lists are represented in hardware for the GDMA module
 */
typedef struct GdmaLinkedList {
    union {
        struct {
            uint32_t size: 12;   // Size of the buffer (mainly used in a receive transaction)
            uint32_t length: 12; // Number of valid bytes in the buffer. In a transmit, written by software.
                                 // In receive, written by hardware.
            uint32_t rsvd_24: 4; // Reserved
            uint32_t err_eof: 1; // Set if received data has errors. Used with UHCI0 only.
            uint32_t rsvd_29: 1; // Reserved
            uint32_t suc_eof: 1; // Set if curent node is the last one (of the list). Set by software in a transmit transaction,
                                 // Set by the hardware in case of a receive transaction.
            uint32_t owner: 1;   // 0: CPU can access the buffer, 1: GDMA can access the buffer. Cleared automatically
                                 // by hardware in a transmit descriptor. In a receive descriptor, cleared by hardware
                                 // only if GDMA_OUT_AUTO_WRBACK_CHn is set to 1.
        };
        uint32_t val;
    } config;
    uint32_t buf_addr;
    uint32_t next_addr;
} GdmaLinkedList;


static uint32_t read_addr_word(uint32_t* ptr, uint32_t offset) {
    return ptr[offset / sizeof(uint32_t)];
}


static uint64_t esp32c3_gdma_read(void *opaque, hwaddr addr, unsigned int size)
{
    ESP32C3GdmaState *s = ESP32C3_GDMA(opaque);
    uint64_t r = 0;

#if GDMA_DEBUG
    info_report("[GDMA] Reading from %08lx (%08lx)\n", addr, r);
#endif

    switch(addr) {
        case A_DMA_INT_RAW_CH0 ... A_DMA_INT_CLR_CH2:
            r = read_addr_word((uint32_t*) s->ch_int, addr - A_DMA_INT_RAW_CH0);
            break;

        case A_DMA_MISC_CONF:
            r = s->misc_conf;
            break;

        case A_DMA_IN_CONF0_CH0 ... A_DMA_IN_PERI_SEL_CH0:
            r = read_addr_word((uint32_t*) &s->ch_conf[0][ESP32C3_GDMA_IN_IDX], addr - A_DMA_IN_CONF0_CH0);
            break;

        case A_DMA_OUT_CONF0_CH0 ... A_DMA_OUT_PERI_SEL_CH0:
            r = read_addr_word((uint32_t*) &s->ch_conf[0][ESP32C3_GDMA_OUT_IDX], addr - A_DMA_OUT_CONF0_CH0);
            break;

        case A_DMA_IN_CONF0_CH1 ... A_DMA_IN_PERI_SEL_CH1:
            r = read_addr_word((uint32_t*) &s->ch_conf[1][ESP32C3_GDMA_IN_IDX], addr - A_DMA_IN_CONF0_CH1);
            break;

        case A_DMA_OUT_CONF0_CH1 ... A_DMA_OUT_PERI_SEL_CH1:
            r = read_addr_word((uint32_t*) &s->ch_conf[1][ESP32C3_GDMA_OUT_IDX], addr - A_DMA_OUT_CONF0_CH1);
            break;

        case A_DMA_IN_CONF0_CH2 ... A_DMA_IN_PERI_SEL_CH2:
            r = read_addr_word((uint32_t*) &s->ch_conf[2][ESP32C3_GDMA_IN_IDX], addr - A_DMA_IN_CONF0_CH2);
            break;

        case A_DMA_OUT_CONF0_CH2 ... A_DMA_OUT_PERI_SEL_CH2:
            r = read_addr_word((uint32_t*) &s->ch_conf[2][ESP32C3_GDMA_OUT_IDX], addr - A_DMA_OUT_CONF0_CH2);
            break;

        default:
#if GDMA_WARNING
            warn_report("[GDMA] Unsupported read to %08lx\n", addr);
#endif
            break;
    }

    return r;
}


/**
 * @brief Check whether the new status of any interrupt should trigger an interrupt
 *
 * @param s GDMA state structure
 * @param chan Channel that has just been updated
 */
static void esp32c3_gdma_check_interrupt_status(ESP32C3GdmaState *s, uint32_t chan)
{
    DmaIntState* const int_st = &s->ch_int[chan];
    const uint32_t former = int_st->st;

    /* Calculate the new status and check for any difference */
    int_st->st = int_st->raw & int_st->ena;

    if (former != int_st->st) {
        /* If all the status bits became low, lower the IRQ pin, else, raise it  */
        qemu_set_irq(s->irq[chan], int_st->st ? 1 : 0);
    }
}


/**
 * @brief Set the status bit for the given channel. If the status triggers an interrupt, the corresponding
 * IRQ will be set.
*/
static void esp32c3_gdma_set_status(ESP32C3GdmaState *s, uint32_t chan, uint32_t mask)
{
    s->ch_int[chan].raw |= mask;
    esp32c3_gdma_check_interrupt_status(s, chan);
}



/**
 * @brief Clear the status bit for the given channel
*/
static void esp32c3_gdma_clear_status(ESP32C3GdmaState *s, uint32_t chan, uint32_t mask)
{
    s->ch_int[chan].raw &= ~mask;
    esp32c3_gdma_check_interrupt_status(s, chan);
}


/**
 * @brief Function called when a write to a channel interrupt register is performed
 *
 * @param s GDMA state structure
 * @param chan Index of the channel to be written
 * @param reg Offset, in bytes, of the register to modify
 * @param value New value for the register
 */
static void esp32c3_gdma_write_int_state(ESP32C3GdmaState *s, uint32_t chan, uint32_t reg, uint32_t value)
{
    switch (reg) {
        case offsetof(DmaIntState, ena):
            s->ch_int[chan].ena = value;
            break;

        case offsetof(DmaIntState, raw):
        case offsetof(DmaIntState, clr):
            /* Clear the bits that are set to 1, keep the remaining to their original value */
            s->ch_int[chan].raw &= ~value;
            break;

        case offsetof(DmaIntState, st):
        default:
            /* Nothing to do, read-only register, return directly */
            return;
    }

    /* Update the status and check if any interrupt needs to occur */
    esp32c3_gdma_check_interrupt_status(s, chan);
}


/**
 * @brief Function called when a reset FIFO is requested
 *
 * @param s GDMA state structure
 * @param chan Index of the channel
 * @param in_out Index of the direction, ESP32C3_GDMA_IN_IDX or ESP32C3_GDMA_OUT_IDX,
 *        that needs a FIFO reset
 */
static void esp32c3_gdma_reset_fifo(ESP32C3GdmaState *s, uint32_t chan, uint32_t in_out)
{
#if GDMA_DEBUG
    info_report("Resetting FIFO for chan %d, direction: %d\n", chan, in_out);
#endif
    /* Set the FIFO empty bit to 1, full bit to 0, and number of bytes of data to 0 */
    s->ch_conf[chan][in_out].status = R_DMA_INFIFO_STATUS_CH0_INFIFO_EMPTY_CH0_MASK;
}


/**
 * @brief Check that the given 32-bit address is in a given range
 *
 * @param range_start Start address of range
 * @param range_size Size of the SoC DRAM
 * @param addr Linked-list node address
 *
 * @returns true if the node is valid (in DRAM), false else
 */
static inline bool esp32c3_gdma_addr_in_range(uint32_t range_start, uint32_t range_size, uint32_t addr)
{
    return range_start <= addr && addr < (range_start + range_size);
}


/**
 * @brief Read a descriptor from the guest machine
 *
 * @param s GDMA state structure
 * @param addr Guest machine address
 *
 * @returns true if the transfer was a success, false else
 */
static bool esp32c3_gdma_read_descr(ESP32C3GdmaState *s, uint32_t addr, GdmaLinkedList* out)
{
    MemTxResult res = dma_memory_read(&s->dma_as, addr, out, sizeof(GdmaLinkedList), MEMTXATTRS_UNSPECIFIED);
    return res == MEMTX_OK;
}

/**
 * @brief Write a descriptor to the guest machine
 *
 * @param s GDMA state structure
 * @param addr Guest machine address
 *
 * @returns true if the transfer was a success, false else
 */
static bool esp32c3_gdma_write_descr(ESP32C3GdmaState *s, uint32_t addr, GdmaLinkedList* in)
{
    MemTxResult res = dma_memory_write(&s->dma_as, addr, in, sizeof(GdmaLinkedList), MEMTXATTRS_UNSPECIFIED);
    return res == MEMTX_OK;
}



/**
 * @brief Read and write arbitrary data from and to the guest machine
 *
 * @param s GDMA state structure
 * @param addr Guest machine address
 *
 * @returns true if the transfer was a success, false else
 */
static bool esp32c3_gdma_read_guest(ESP32C3GdmaState *s, uint32_t addr, void* data, uint32_t len)
{
    MemTxResult res = dma_memory_read(&s->dma_as, addr, data, len, MEMTXATTRS_UNSPECIFIED);
    return res == MEMTX_OK;
}

