esp32-open-mac/qemu/hw/dma/esp32c3_gdma.c
    /* Dereference the former value of the register being written to */
    const uint32_t former = *reg_addr;

    /* Write the new value to the register if not read-only! */
    if (!esp32c3_gdma_register_read_only(addr_in_block)) {
        *reg_addr = value;
    }

    /* We will only support a subset of GDMA registers for now. To add support for more registers,
     * the following snippet can be update */
    uint32_t start_mask = 0;
    uint32_t restart_mask = 0;
    switch(addr_in_block) {

        /* No matter the channel and in/out direction, the registers are organized the same way,
         * so we can use the macros for any channel */
        case offsetof(DmaConfigState, conf0):
            /* Check the reset bit, call the reset function on negative edge */
            if (FIELD_EX32(value,  DMA_IN_CONF0_CH0, IN_RST_CH0) == 0 &&
                FIELD_EX32(former, DMA_IN_CONF0_CH0, IN_RST_CH0) != 0)
            {
                esp32c3_gdma_reset_fifo(s, chan, in_out);
            }
            /* Check if memory transfer has just been enabled (only valid for IN channels) */
            if (in_out == ESP32C3_GDMA_IN_IDX &&
                FIELD_EX32(value,  DMA_IN_CONF0_CH0, MEM_TRANS_EN_CH0))
            {
                esp32c3_gdma_check_and_start_mem_transfer(s, chan);
            }
            break;

        case offsetof(DmaConfigState, link):
            /* For IN and OUT, the START bit is not at the same offset, so we need to test both separately */
            start_mask = ESP32C3_GDMA_IN_IDX ? R_DMA_IN_LINK_CH0_INLINK_START_CH0_MASK : R_DMA_OUT_LINK_CH0_OUTLINK_START_CH0_MASK;
            restart_mask = ESP32C3_GDMA_IN_IDX ? R_DMA_IN_LINK_CH0_INLINK_RESTART_CH0_MASK : R_DMA_OUT_LINK_CH0_OUTLINK_RESTART_CH0_MASK;

            /* Check if any of the previous two bits has just been enabled */
            if ((value & start_mask) || (value & restart_mask))
            {
                esp32c3_gdma_check_and_start_mem_transfer(s, chan);
            }

        default:
            break;
    }
}


static void esp32c3_gdma_write(void *opaque, hwaddr addr,
                              uint64_t value, unsigned int size)
{
    ESP32C3GdmaState *s = ESP32C3_GDMA(opaque);

#if GDMA_DEBUG
    info_report("[GDMA] Writing to %08lx (%08lx)\n", addr, value);
#endif

    switch(addr) {
        case A_DMA_INT_RAW_CH0 ... A_DMA_INT_CLR_CH2:
            esp32c3_gdma_write_int_state(s,
                                         addr / ESP32C3_GDMA_INT_REGS_SIZE,
                                         addr % ESP32C3_GDMA_INT_REGS_SIZE,
                                         value);
            break;

        case A_DMA_MISC_CONF:
            s->misc_conf = value;
            break;

        case A_DMA_IN_CONF0_CH0 ... A_DMA_IN_PERI_SEL_CH0:
            esp32c3_gdma_write_chan_conf(s, 0, ESP32C3_GDMA_IN_IDX, addr - A_DMA_IN_CONF0_CH0, value);
            break;

        case A_DMA_OUT_CONF0_CH0 ... A_DMA_OUT_PERI_SEL_CH0:
            esp32c3_gdma_write_chan_conf(s, 0, ESP32C3_GDMA_OUT_IDX, addr - A_DMA_OUT_CONF0_CH0, value);
            break;

        case A_DMA_IN_CONF0_CH1 ... A_DMA_IN_PERI_SEL_CH1:
            esp32c3_gdma_write_chan_conf(s, 1, ESP32C3_GDMA_IN_IDX, addr - A_DMA_IN_CONF0_CH1, value);
            break;

        case A_DMA_OUT_CONF0_CH1 ... A_DMA_OUT_PERI_SEL_CH1:
            esp32c3_gdma_write_chan_conf(s, 1, ESP32C3_GDMA_OUT_IDX, addr - A_DMA_OUT_CONF0_CH1, value);
            break;

        case A_DMA_IN_CONF0_CH2 ... A_DMA_IN_PERI_SEL_CH2:
            esp32c3_gdma_write_chan_conf(s, 2, ESP32C3_GDMA_IN_IDX, addr - A_DMA_IN_CONF0_CH2, value);
            break;

        case A_DMA_OUT_CONF0_CH2 ... A_DMA_OUT_PERI_SEL_CH2:
            esp32c3_gdma_write_chan_conf(s, 2, ESP32C3_GDMA_OUT_IDX, addr - A_DMA_OUT_CONF0_CH2, value);
            break;

        default:
#if GDMA_WARNING
            warn_report("[GDMA] Unsupported write to %08lx (%08lx)\n", addr, value);
#endif
            break;
    }

}

static const MemoryRegionOps esp32c3_gdma_ops = {
    .read =  esp32c3_gdma_read,
    .write = esp32c3_gdma_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};


static Property esp32c3_gdma_properties[] = {
    DEFINE_PROP_LINK("soc_mr", ESP32C3GdmaState, soc_mr, TYPE_MEMORY_REGION, MemoryRegion*),
    DEFINE_PROP_END_OF_LIST(),
};


static void esp32c3_gdma_reset(DeviceState *dev)
{
    ESP32C3GdmaState *s = ESP32C3_GDMA(dev);
    memset(s->ch_int, 0, sizeof(s->ch_int));
    memset(s->ch_conf, 0, sizeof(s->ch_conf));
    s->misc_conf = 0;

    /* Set the FIFOs as empty */
    for (int i = 0; i < ESP32C3_GDMA_CHANNEL_COUNT; i++) {
        qemu_irq_lower(s->irq[i]);

        for (int j = 0; j < ESP32C3_GDMA_CONF_COUNT; j++) {
            esp32c3_gdma_reset_fifo(s, i, j);
        }
    }

}


static void esp32c3_gdma_realize(DeviceState *dev, Error **errp)
{
    ESP32C3GdmaState *s = ESP32C3_GDMA(dev);

    /* Make sure the DRAM MemoryRegion was set */
    assert(s->soc_mr != NULL);

    address_space_init(&s->dma_as, s->soc_mr, "esp32c3.gdma");
}


static void esp32c3_gdma_init(Object *obj)
{
    ESP32C3GdmaState *s = ESP32C3_GDMA(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->iomem, obj, &esp32c3_gdma_ops, s,
                          TYPE_ESP32C3_GDMA, ESP32C3_GDMA_REGS_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);

    for (int i = 0; i < ESP32C3_GDMA_CHANNEL_COUNT; i++) {
        sysbus_init_irq(sbd, &s->irq[i]);
    }

    esp32c3_gdma_reset((DeviceState*) s);
}


static void esp32c3_gdma_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = esp32c3_gdma_reset;
    dc->realize = esp32c3_gdma_realize;
    device_class_set_props(dc, esp32c3_gdma_properties);
}

static const TypeInfo esp32c3_gdma_info = {
        .name = TYPE_ESP32C3_GDMA,
        .parent = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(ESP32C3GdmaState),
        .instance_init = esp32c3_gdma_init,
        .class_init = esp32c3_gdma_class_init
};

static void esp32c3_gdma_register_types(void)
{
    type_register_static(&esp32c3_gdma_info);
}

type_init(esp32c3_gdma_register_types)
